[Killed] BlockStatement
classifyTriangle.js:1:36
-function classifyTriangle(a, b, c) {
-    // Check input conditions C1, C2, and C3
-    if (a < 1 || a > 200 || b < 1 || b > 200 || c < 1 || c > 200) {
-        return "Error: Input conditions C1, C2, or C3 failed.";
-    }
-
-    // Check conditions C4, C5, and C6 to determine if it's a valid triangle
-    if (a >= b + c || b >= a + c || c >= a + b) {
-        return "Not a Triangle";
-    }
-
-    // Classification based on side equality
-    if (a === b && b === c) {
-        return "Equilateral";
-    } else if (a === b || a === c || b === c) {
-        return "Isosceles";
-    } else {
-        return "Scalene";
-    }
-}
+function classifyTriangle(a, b, c) {}
 // this is a module!
 
killedBy: classifyTriangle mutation-testing demo returns Equilateral for equal valid sides
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Equilateral"
Received: undefined

[Killed] EqualityOperator
classifyTriangle.js:3:9
 function classifyTriangle(a, b, c) {
     // Check input conditions C1, C2, and C3
-    if (a < 1 || a > 200 || b < 1 || b > 200 || c < 1 || c > 200) {
+    if (a <= 1 || a > 200 || b < 1 || b > 200 || c < 1 || c > 200) {
         return "Error: Input conditions C1, C2, or C3 failed.";
     }
killedBy: classifyTriangle mutation-testing demo returns Not a Triangle for one invalid triangle case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Not a Triangle"
Received: "Error: Input conditions C1, C2, or C3 failed."

[Killed] ConditionalExpression
classifyTriangle.js:3:9
 function classifyTriangle(a, b, c) {
     // Check input conditions C1, C2, and C3
-    if (a < 1 || a > 200 || b < 1 || b > 200 || c < 1 || c > 200) {
+    if (true) {
         return "Error: Input conditions C1, C2, or C3 failed.";
     }
killedBy: classifyTriangle mutation-testing demo returns Equilateral for equal valid sides
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Equilateral"
Received: "Error: Input conditions C1, C2, or C3 failed."

[Killed] StringLiteral
classifyTriangle.js:4:16
 function classifyTriangle(a, b, c) {
     // Check input conditions C1, C2, and C3
     if (a < 1 || a > 200 || b < 1 || b > 200 || c < 1 || c > 200) {
-        return "Error: Input conditions C1, C2, or C3 failed.";
+        return "";
     }
 
killedBy: classifyTriangle mutation-testing demo returns Error when one side is too small
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Error: Input conditions C1, C2, or C3 failed."
Received: ""

[Killed] ConditionalExpression
classifyTriangle.js:8:37
     }
 
     // Check conditions C4, C5, and C6 to determine if it's a valid triangle
-    if (a >= b + c || b >= a + c || c >= a + b) {
+    if (a >= b + c || b >= a + c || false) {
         return "Not a Triangle";
     }
killedBy: classifyTriangle mutation-testing demo returns Not a Triangle for one invalid triangle case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Not a Triangle"
Received: "Scalene"

[Killed] ArithmeticOperator
classifyTriangle.js:8:42
     }
 
     // Check conditions C4, C5, and C6 to determine if it's a valid triangle
-    if (a >= b + c || b >= a + c || c >= a + b) {
+    if (a >= b + c || b >= a + c || c >= a - b) {
         return "Not a Triangle";
     }
killedBy: classifyTriangle mutation-testing demo returns Equilateral for equal valid sides
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Equilateral"
Received: "Not a Triangle"

[Killed] StringLiteral
classifyTriangle.js:9:16
 
     // Check conditions C4, C5, and C6 to determine if it's a valid triangle
     if (a >= b + c || b >= a + c || c >= a + b) {
-        return "Not a Triangle";
+        return "";
     }
 
killedBy: classifyTriangle mutation-testing demo returns Not a Triangle for one invalid triangle case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Not a Triangle"
Received: ""

[Killed] EqualityOperator
classifyTriangle.js:13:9
     }
 
     // Classification based on side equality
-    if (a === b && b === c) {
+    if (a !== b && b === c) {
         return "Equilateral";
     } else if (a === b || a === c || b === c) {
killedBy: classifyTriangle mutation-testing demo returns Equilateral for equal valid sides
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Equilateral"
Received: "Isosceles"

[Killed] EqualityOperator
classifyTriangle.js:13:20
     }
 
     // Classification based on side equality
-    if (a === b && b === c) {
+    if (a === b && b !== c) {
         return "Equilateral";
     } else if (a === b || a === c || b === c) {
killedBy: classifyTriangle mutation-testing demo returns Equilateral for equal valid sides
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Equilateral"
Received: "Isosceles"

[Killed] StringLiteral
classifyTriangle.js:14:16
 
     // Classification based on side equality
     if (a === b && b === c) {
-        return "Equilateral";
+        return "";
     } else if (a === b || a === c || b === c) {
         return "Isosceles";
killedBy: classifyTriangle mutation-testing demo returns Equilateral for equal valid sides
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Equilateral"
Received: ""

[Survived] LogicalOperator
classifyTriangle.js:15:16
     // Classification based on side equality
     if (a === b && b === c) {
         return "Equilateral";
-    } else if (a === b || a === c || b === c) {
+    } else if ((a === b || a === c) && b === c) {
         return "Isosceles";
     } else {

[Survived] LogicalOperator
classifyTriangle.js:15:16
     // Classification based on side equality
     if (a === b && b === c) {
         return "Equilateral";
-    } else if (a === b || a === c || b === c) {
+    } else if (a === b && a === c || b === c) {
         return "Isosceles";
     } else {

[Survived] BlockStatement
classifyTriangle.js:17:12
         return "Equilateral";
     } else if (a === b || a === c || b === c) {
         return "Isosceles";
-    } else {
-        return "Scalene";
-    }
+    } else {}
 }
 // this is a module!

[Survived] StringLiteral
classifyTriangle.js:18:16
     } else if (a === b || a === c || b === c) {
         return "Isosceles";
     } else {
-        return "Scalene";
+        return "";
     }
 }
